Use mermaid in state diagrams
